Revit 2024 API
ModelCurveArray.Append Method
Add the model curve to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Append(
	ModelCurve item
)
Visual Basic
Public Overridable Sub Append ( _
	item As ModelCurve _
)
Visual C++
public:
virtual void Append(
	ModelCurve^ item
)
Parameters
item
Type: Autodesk.Revit.DB.ModelCurve
The model curve to be added.
See Also
ModelCurveArray Class
Autodesk.Revit.DB Namespace